thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512GP806.h
extern volatile RPINR27BITS RPINR27bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR28 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR28BITS {
  union {
    struct {
      unsigned U4RXR:7;
      unsigned :1;
      unsigned U4CTSR:7;
    };
    struct {
      unsigned U4RXR0:1;
      unsigned U4RXR1:1;
      unsigned U4RXR2:1;
      unsigned U4RXR3:1;
      unsigned U4RXR4:1;
      unsigned U4RXR5:1;
      unsigned U4RXR6:1;
      unsigned :1;
      unsigned U4CTSR0:1;
      unsigned U4CTSR1:1;
      unsigned U4CTSR2:1;
      unsigned U4CTSR3:1;
      unsigned U4CTSR4:1;
      unsigned U4CTSR5:1;
      unsigned U4CTSR6:1;
    };
  };
} RPINR28BITS;
extern volatile RPINR28BITS RPINR28bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR29 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR29BITS {
  union {
    struct {
      unsigned SDI3R:7;
      unsigned :1;
      unsigned SCK3R:7;
    };
    struct {
      unsigned SDI3R0:1;
      unsigned SDI3R1:1;
      unsigned SDI3R2:1;
      unsigned SDI3R3:1;
      unsigned SDI3R4:1;
      unsigned SDI3R5:1;
      unsigned SDI3R6:1;
      unsigned :1;
      unsigned SCK3R0:1;
      unsigned SCK3R1:1;
      unsigned SCK3R2:1;
      unsigned SCK3R3:1;
      unsigned SCK3R4:1;
      unsigned SCK3R5:1;
      unsigned SCK3R6:1;
    };
  };
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR30 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR30BITS {
  union {
    struct {
      unsigned SS3R:7;
    };
    struct {
      unsigned SS3R0:1;
      unsigned SS3R1:1;
      unsigned SS3R2:1;
      unsigned SS3R3:1;
      unsigned SS3R4:1;
      unsigned SS3R5:1;
      unsigned SS3R6:1;
    };
  };
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR31 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR31BITS {
  union {
    struct {
      unsigned SDI4R:7;
      unsigned :1;
      unsigned SCK4R:7;
    };
    struct {
      unsigned SDI4R0:1;
      unsigned SDI4R1:1;
      unsigned SDI4R2:1;
      unsigned SDI4R3:1;
      unsigned SDI4R4:1;
      unsigned SDI4R5:1;
      unsigned SDI4R6:1;
      unsigned :1;
      unsigned SCK4R0:1;
      unsigned SCK4R1:1;
      unsigned SCK4R2:1;
      unsigned SCK4R3:1;
      unsigned SCK4R4:1;
      unsigned SCK4R5:1;
      unsigned SCK4R6:1;
    };
  };
} RPINR31BITS;
extern volatile RPINR31BITS RPINR31bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR32 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR32BITS {
  union {
    struct {
      unsigned SS4R:7;
    };
    struct {
      unsigned SS4R0:1;
      unsigned SS4R1:1;
      unsigned SS4R2:1;
      unsigned SS4R3:1;
      unsigned SS4R4:1;
      unsigned SS4R5:1;
      unsigned SS4R6:1;
    };
  };
} RPINR32BITS;
extern volatile RPINR32BITS RPINR32bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR33 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR33BITS {
  union {
    struct {
      unsigned IC9R:7;
      unsigned :1;
      unsigned IC10R:7;
    };
    struct {
      unsigned IC9R0:1;
      unsigned IC9R1:1;
      unsigned IC9R2:1;
      unsigned IC9R3:1;
      unsigned IC9R4:1;
      unsigned IC9R5:1;
      unsigned IC9R6:1;
      unsigned :1;
      unsigned IC10R0:1;
      unsigned IC10R1:1;
      unsigned IC10R2:1;
      unsigned IC10R3:1;
      unsigned IC10R4:1;
      unsigned IC10R5:1;
      unsigned IC10R6:1;
    };
  };
} RPINR33BITS;
extern volatile RPINR33BITS RPINR33bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR34 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR34BITS {
  union {
    struct {
      unsigned IC11R:7;
      unsigned :1;
      unsigned IC12R:7;
    };
    struct {
      unsigned IC11R0:1;
      unsigned IC11R1:1;
      unsigned IC11R2:1;
      unsigned IC11R3:1;
      unsigned IC11R4:1;
      unsigned IC11R5:1;
      unsigned IC11R6:1;
      unsigned :1;
      unsigned IC12R0:1;
      unsigned IC12R1:1;
      unsigned IC12R2:1;
      unsigned IC12R3:1;
      unsigned IC12R4:1;
      unsigned IC12R5:1;
      unsigned IC12R6:1;
    };
  };
} RPINR34BITS;
extern volatile RPINR34BITS RPINR34bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR35 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR35BITS {
  union {
    struct {
      unsigned IC13R:7;
      unsigned :1;
      unsigned IC14R:7;
    };
    struct {
      unsigned IC13R0:1;
      unsigned IC13R1:1;
      unsigned IC13R2:1;
      unsigned IC13R3:1;
      unsigned IC13R4:1;
      unsigned IC13R5:1;
      unsigned IC13R6:1;
      unsigned :1;
      unsigned IC14R0:1;
      unsigned IC14R1:1;
      unsigned IC14R2:1;
      unsigned IC14R3:1;
      unsigned IC14R4:1;
      unsigned IC14R5:1;
      unsigned IC14R6:1;
    };
  };
} RPINR35BITS;
extern volatile RPINR35BITS RPINR35bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR36 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR36BITS {
  union {
    struct {
      unsigned IC15R:7;
      unsigned :1;
      unsigned IC16R:7;
    };
    struct {
      unsigned IC15R0:1;
      unsigned IC15R1:1;
      unsigned IC15R2:1;
      unsigned IC15R3:1;
      unsigned IC15R4:1;
      unsigned IC15R5:1;
      unsigned IC15R6:1;
      unsigned :1;
      unsigned IC16R0:1;
      unsigned IC16R1:1;
      unsigned IC16R2:1;
      unsigned IC16R3:1;
      unsigned IC16R4:1;
      unsigned IC16R5:1;
      unsigned IC16R6:1;
    };
  };
} RPINR36BITS;
extern volatile RPINR36BITS RPINR36bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      unsigned OCFCR:7;
    };
    struct {
      unsigned OCFCR0:1;
      unsigned OCFCR1:1;
      unsigned OCFCR2:1;
      unsigned OCFCR3:1;
      unsigned OCFCR4:1;
      unsigned OCFCR5:1;
      unsigned OCFCR6:1;
    };
  };
} RPINR37BITS;
